NextFOAM-2606/tutorials/combustion/fireFoam/LES/compartmentFire/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 294.75;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 371.15;
    }

    entrainment
    {
        type            inletOutlet;
        inletValue      uniform 294.75;
        value           uniform 294.75;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 294.75;
        value           uniform 294.75;
    }

    region0_to_panelRegion_wallPanel
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        value           uniform 294.75;
        Tnbr            T;
        qrNbr           none;
        qr              qr;
        kappaMethod     fluidThermo;
    }

    region0_to_panelRegion_internalWallPanel_top
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        value           uniform 294.75;
        Tnbr            T;
        qrNbr           none;
        qr              qr;
        kappaMethod     fluidThermo;
    }

    region0_to_panelRegion_internalWallPanel_bottom
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        value           uniform 294.75;
        Tnbr            T;
        qrNbr           none;
        qr              qr;
        kappaMethod     fluidThermo;
    }
}


// ************************************************************************* //
